"""第二十节，集合_循环遍历"""

"""
这一节代码整体在讲：集合的循环遍历。

本节对应课程大纲里的知识点：
1. 集合不能使用 while 循环遍历
2. 集合可以使用 for 循环遍历
"""

print('=========================== 教程区 ============================')

s1 = {10, 20, 30, 40, 50, 60}

print('------------------- 1. 集合不能使用 while 循环遍历 -------------------')

print('集合没有下标，不能用 while 遍历')
print('集合不能通过下标访问元素')
print()  # 输出空行

print('-------------------- 2. 集合可以使用 for 循环遍历 --------------------')

for item in s1:
    print(item)
print()  # 输出空行

print('=========================== 习题区 ============================')


print('--------------------------- 练习 1 ---------------------------')
# 练习 1：
# 有一个集合：
# colors = {'red', 'green', 'blue', 'yellow'}
# 请使用 for 循环遍历并打印每个元素
colors = {'red', 'green', 'blue', 'yellow'}
for color in colors:
    print(color)

print('--------------------------- 练习 2 ---------------------------')
# 练习 2：
# 有一个集合：
# nums = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10}
# 请使用 for 循环，找出所有大于 5 的元素并打印
nums = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10}
for num in nums:
    if num > 5:
        print(num)